Tekla.Structures.Catalogs.CrossSection
The CrossSection class defines a with cross section points
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
CrossSection section = new CrossSection("HEA100");
if (section.Select())
{
var outerSurface = section.OuterSurface;
if(outerSurface != null)
{
foreach (CrossSectionPoint point in outerSurface)
{
Console.WriteLine("Point " + string.Format("({0:0.000}, {1:0.000}, {2:0.000})", point.X, point.Y, point.Z));
Console.WriteLine("Chamfer type " + point.Chamfer.Type.ToString());
Console.WriteLine("Chamfer " + string.Format("({0:0.000}, {1:0.000}, {2:0.000}, {3:0.000})", point.Chamfer.X, point.Chamfer.Y, point.Chamfer.DZ1, point.Chamfer.DZ2));
}
Console.WriteLine("HEA100 cross section points selected successfully");
}
}
}
}

Tekla.Structures.Catalogs.CrossSection.MAX_CROSS_SECTION_POINTS
Max points in outer or inner surface.

Tekla.Structures.Catalogs.CrossSection.contours
The outer and inner contours for the cross section.

Tekla.Structures.Catalogs.CrossSection.Profile
The profile where cross section is asked from

Tekla.Structures.Catalogs.CrossSection.Location
The location in relation to length, 0.0 referring to start of the profile

Tekla.Structures.Catalogs.CrossSection.Length
The total length

Tekla.Structures.Catalogs.CrossSection.HighAccuracy
The contour geometry accuracy.

Tekla.Structures.Catalogs.CrossSection.OuterSurface
Gets the cross section points for outer surface.

Tekla.Structures.Catalogs.CrossSection.OuterSurfacePoints
Gets the cross section points for outer surface.

Tekla.Structures.Catalogs.CrossSection.InnerSurfaces
Gets the cross section points for inner surfaces.

Tekla.Structures.Catalogs.CrossSection.InnerSurfacePoints
Gets the points for inner surfaces.

Tekla.Structures.Catalogs.CrossSection.#ctor
Creates a new cross section point instance.

Tekla.Structures.Catalogs.CrossSection.#ctor(Tekla.Structures.Catalogs.ProfileName)
Creates a new cross section point instance.
Profile: The profile definition.

Tekla.Structures.Catalogs.CrossSection.#ctor(System.String)
Creates a new cross section point instance.
ProfileString: The profile string.

Tekla.Structures.Catalogs.CrossSection.#ctor(Tekla.Structures.Catalogs.ProfileItem)
Creates a new cross section point instance.
Profile: The profile definition.

Tekla.Structures.Catalogs.CrossSection.Select(System.Double,System.Double)
Selects the cross section from the profile definition.
Location: The location from where cross section is fetched.
Length: The total length of the profile.
Returns: True in success.

Tekla.Structures.Catalogs.CrossSection.Select(System.Boolean,System.Double,System.Double)
Selects the cross section from the profile definition.
HighAccuracy: The geometric accuracy level.
Location: The location from where cross section is fetched.
Length: The total length of the profile.
Returns: True in success.

Tekla.Structures.Catalogs.CrossSection.GetOuterContour
Gets the outer loop geometry as Polycurve.
Returns: Polycurve

Tekla.Structures.Catalogs.CrossSection.GetInnerContours
Gets the inner loop geometries as Polycurve.
Returns: List

Tekla.Structures.Catalogs.CrossSection.GetPointsFromContour(Tekla.Structures.Model.Contour)
Gets the points from contour.
c: The c.
Returns: List<Point>.

Tekla.Structures.Catalogs.CrossSection.GetCrossSectionPointsFromContour(Tekla.Structures.Model.Contour)
Gets the cross section points from contour.
c: The c.
Returns: List<CrossSectionPoint>.

Tekla.Structures.Catalogs.CrossSection.ValidateCrossSection
Validates the cross section.
Throws System.IndexOutOfRangeException: Cross section either not valid or not found. Is selection missing?